Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Go back to previous page
sv: Gå tillbaka till föregående sida

source: The number of sorts that were done by scanning the table.
sv: Antalet sorteringar som har gjorts genom avsökning av tabellen.

source: Edit index
sv: Redigera register

source: Wk
sv: Vecka

source: Repair threads
sv: Reparera trådar

source: phpMyAdmin configuration storage is not configured for "Display Features".
sv: phpMyAdmins konfigurationslagring är inte konfigurerad för "visningsfunktioner".

source: Missing a temporary folder.
sv: Saknar en temporär katalog.

source: Display chart
sv: Visa diagram

source: No partial dependencies selected!
sv: Inga partiella beroenden valda!

source: Expand/Collapse
sv: Expandera/Vik ihop

source: Favorite tables
sv: Favorittabeller

source: Allows connecting, even if maximum number of connections is reached; required for most administrative operations like setting global variables or killing threads of other users.
sv: Tillåter uppkoppling, även om maximala antalet förbindelser är nådd. Nödvändig för de flesta administrativa funktioner, som att sätta globala variabler eller döda andra användares trådar.

source: Whether to show events under database in the navigation tree
sv: Möjliggör visning av händelser kopplade till databas i navigeringsträdet

source: Edit view
sv: Redigera vy

source: Rate of reading fixed position average: %s, this value should be less than 1 per hour
sv: Andelen läsning av fast position i genomsnitt: %s detta värde bör vara mindre än 1 per timme

source: Textarea rows
sv: Textarea rader

source: Changes tracking
sv: Förändringar i spårning

source: Generated configuration file
sv: Genererad konfigurationsfil

source: Host
sv: Värd

source: Only retrieve SELECT,INSERT,UPDATE and DELETE Statements
sv: Hämta endast SELECT-, INSERT-, UPDATE- och DELETE-kommandon

source: shared
sv: delad

source: phpMyAdmin configuration storage
sv: phpMyAdmins konfigurationslagring

source: {long_query_time} is set to 10 seconds or more, thus only slow queries that take above 10 seconds are logged.
sv: {long_query_time} är satt till 10 sekunder eller längre, alltså endast långsamma frågor som tar över 10 sekunder blir loggade.

source: Create new table
sv: Skapa ny tabell

source: Creation
sv: Skapande

source: Allow for searching inside the entire database.
sv: Tillåt sökning i hela databasen.

source: Show hidden navigation tree items.
sv: Visa dolda navigationsträdsobjekt.

source: If your server is also configured to accept HTTPS requests follow this link to use a secure connection.
sv: Om servern även är konfigurerad för att acceptera HTTPS-begäranden följer du den här länken för att använda en säker anslutning.

source: The amount of free memory for query cache.
sv: Mängden fritt minne för frågecache.

source: Justification:
sv: Motivering:

source: Export as %s
sv: Exportera som %s

source: Show this query here again
sv: Visa denna fråga här igen

source: Server choice:
sv: Serverval:

source: Primary replication
sv: Primär replikering

source: This MySQL server does not support the %s storage engine.
sv: Denna MySQL-server stödjer inte lagringsmotorn %s.

source: Go to view: %s
sv: Gå till vy: %s

source: Target database
sv: Måldatabas

source: Table %1$s has been altered successfully.
sv: Tabellen %1$s har ändrats.

source: TiB
sv: TB

source: Drop
sv: Radera

source: Create the needed tables with the <code>%screate_tables.sql</code>.
sv: Skapa nödvändiga tabeller med <code>%screate_tables.sql</code>.

source: Ins:
sv: Infoga:

source: A primary key has been added on %s.
sv: En primär nyckel har lagts till för %s.

source: Today
sv: Idag

source: pages
sv: sidor

source: No index parts defined!
sv: Inga delar av index är definierade!

source: Compress connection
sv: Komprimera anslutning

source: Allow to display database and table statistics (e.g. space usage).
sv: Tillåt visning av databas- och tabellstatistik (t.ex. diskutrymmesanvändning).

source: Page name
sv: Sidnamn

source: Version %s snapshot (SQL code)
sv: Version %s ögonblicksbild (SQL-kod)

source: Grant
sv: Bevilja

source: Row: %1$s, Column: %2$s, Error: %3$s
sv: Rad: %1$s, kolumn: %2$s, fel: %3$s

source: Go back
sv: Gå tillbaka

source: committed on %s by %s
sv: incheckad %s av %s

source: Failed to cleanup table UI preferences (see $cfg['Servers'][$i]['MaxTableUiprefs'] %s)
sv: Misslyckades med att rensa gränssnittsinställningar för tabell (se $cfg['Servers'][$i]['MaxTableUiprefs'] %s)

source: Attributes
sv: Attribut

source: Change
sv: Ändra

source: All status variables
sv: Alla statusvariabler

source: Allows creating new views.
sv: Tillåter skapande av nya vyer.

source: Hide databases matching regular expression (PCRE).
sv: Dölj databaser som matchar reguljärt uttryck (PCRE).

source: Please be patient, the file is being uploaded. Details about the upload are not available.
sv: Vänligen vänta, filen laddas upp. Detaljer om denna uppladdning är inte tillgängliga.

source: Customize default options
sv: Anpassa förvalda alternativ

source: You are currently using %s%% of your memory for the InnoDB buffer pool. This rule fires if you are assigning less than 60%%, however this might be perfectly adequate for your system if you don't have much InnoDB tables or other services running on the same machine.
sv: Du använder för närvarande %s%% av ditt minne för InnoDB bufferpool. Denna regel aktiveras om du tilldelar mindre än 60%%, men detta kan vara fullt tillräckligt för ditt system om du inte har så många InnoDB-tabeller eller andra tjänster som körs på samma maskin.

source: QBE saved searches table
sv: QBE sparade sökningar

source: Copying database
sv: Kopiera databas

source: This is the amount of memory allocated to the record cache used to cache table data. The default value is 32MB. This memory is used to cache changes to the handle data (.xtd) and row pointer (.xtr) files.
sv: Detta är mängden minne som allokeras för radcachen som används för cache av tabelldata. Standardvärdet är 32MB. Detta minne används för att cacha ändringar i filer för hanteringsdata (.xtd) och radpekare (.xtr).

source: March
sv: mars

source: Wrong data or no validation for %s
sv: Felaktiga data eller ingen validering för %s

source: Do not change the password
sv: Ändra inte lösenordet

source: Limits the number of simultaneous connections the user may have.
sv: Begränsar antalet samtidiga förbindelser som användaren kan ha.

source: Replica IO Thread not running!
sv: Replikans I/O-tråd körs inte.

source: Query cache fragmentation
sv: Frågecache-fragmentering

source: Please fix this field
sv: Var vänlig och rätta detta fält

source: The percentage of garbage in a data log file before it is compacted. This is a value between 1 and 99. The default is 50.
sv: Andelen skräp i en dataloggfil innan den komprimeras. Detta är ett värde mellan 1 och 99. Standardvärdet är 50.

source: (current)
sv: (aktuell)

source: The number of doublewrite operations that have been performed.
sv: Antalet doublewrite transaktioner som har utförts..

source: The number of unused blocks in the key cache. You can use this value to determine how much of the key cache is in use.
sv: Antalet oanvända block i nyckelcachen. Du kan använda detta värde för att avgöra hur stor del av nyckelcachen som används.

source: The password for authenticating with the proxy.
sv: Lösenordet för autentisering med proxy.

source: Primary key default sort order
sv: Primärnyckels förvandla sorteringsordning

source: Please provide a name for this bookmarked search.
sv: Ange ett namn för denna bokmärkta sökning.

source: Order:
sv: Sorteringsordning:

source: Save & close
sv: Avsluta och Spara

source: Preset chart
sv: Förinställt diagram

source: Entered captcha is wrong, try again!
sv: Angivet captcha är fel, försök igen!

source: Submitted form contains errors
sv: Skickat formulär innehåller fel

source: OpenDocument Spreadsheet
sv: OpenDocument-kalkylblad

source: You must provide an event name!
sv: Du måste ange ett händelsenamn!

source: The number of key blocks in the key cache that have changed but haven't yet been flushed to disk. It used to be known as Not_flushed_key_blocks.
sv: Antalet nyckelblock i nyckelcachen som har ändrats men inte ännu överförts till disk. Det brukade vara känt som Not_flushed_key_blocks.

source: Rename table to
sv: Döp om tabellen till

source: Link not found!
sv: Länken hittades inte!

source: The following query has failed: "%s"
sv: Följande fråga har fallerat: "%s"

source: Dump TIMESTAMP columns in UTC <i>(enables TIMESTAMP columns to be dumped and reloaded between servers in different time zones)</i>
sv: Dumpa TIMESTAMP-kolumner i UTC <i>(gör TIMESTAMP-kolumner som ska dumpas och laddas mellan servrar i olika tidszoner)</i>

source: Flush (close) all tables
sv: Flusha (stäng) alla tabeller

source: Error in processing request: No routine with name %1$s found in database %2$s. You might be lacking the necessary privileges to view/export this routine.
sv: Fel vid behandling av begäran: Ingen rutin med namnet %1$s hittades i databasen %2$s. Du kanske saknar behörighet att visa/exportera den här rutinen.

source: Metadata for database %s
sv: Metadata för databasen %s

source: This action may change some of the columns definition.[br]Are you sure you want to continue?
sv: Den här åtgärden kan ändra några av kolumnerna definitionen.[br]Är du säker på att du vill fortsätta?

source: split into
sv: delas upp i

source: You can not open, save or delete your page layout, as IndexedDB is not working in your browser and your phpMyAdmin configuration storage is not configured for this.
sv: Du kan inte öppna, spara eller ta bort sidlayouten eftersom IndexedDB inte fungerar i webbläsaren och phpMyAdmins konfigurationslagring inte är konfigurerad för detta.

source: Log file threshold
sv: Gräns för loggfil

source: Change to %s
sv: Ändra till %s

source: Table search
sv: Tabellsökning

source: Synonym for DOUBLE (exception: in REAL_AS_FLOAT SQL mode it is a synonym for FLOAT)
sv: Synonym för DOUBLE (undantag: i REAL_AS_FLOAT SQL läget är det en synonym för FLOAT)

source: Enable %s
sv: Aktivera %s

source: Output:
sv: Utdata:

source: phpMyAdmin configuration snippet
sv: phpMyAdmin-konfigurationssnutt

source: Appearance settings
sv: Anpassa utseende

source: Settings that didn't fit anywhere else.
sv: Inställningar som inte passade någon annanstans.

source: Please enter a valid date ( ISO )
sv: Ange ett giltigt datum (ISO)

source: Edit
sv: Redigera

source: Find and replace - preview
sv: Sök och ersätt - förhandsgranskning

source: after %s
sv: efter %s

source: The configuration file needs a valid key for query encryption. A temporary key was automatically generated for you. Please refer to the [doc@cfg_URLQueryEncryptionSecretKey]documentation[/doc].
sv: Konfigurationsfilen behöver en giltig nyckel för frågekryptering. En tillfällig nyckel skapades automatiskt åt dig. Se [doc@cfg_URLQueryEncryptionSecretKey]dokumentationen[/doc].

source: Edit privileges
sv: Redigera behörigheter

source: Sorted rows average: %s
sv: Genomsnittligt antal sorterade rader: %s

source: This generally happens in case of general system overload as it is pretty simple operations. You might want to monitor your system load carefully.
sv: Detta händer i allmänhet vid generell överbelastning av systemet då det är ganska enkla operationer. Du bör kanske övervaka din system last noggrant.

source: per hour
sv: per timme

source: Compress gzip exports on the fly without the need for much memory; if you encounter problems with created gzip files disable this feature.
sv: Komprimera gzip-exporter i farten utan att det behövs mycket minne; inaktivera funktionen om du får problem med skapade gzip-filer.

source: Depending on your environment, it might be performance increasing to reduce this value.
sv: Beroende på den aktuella miljön kan prestandan öka genom att minska detta värde.

source: Number of columns for CHAR/VARCHAR textareas.
sv: Antal kolumner för CHAR/VARCHAR textfält.

source: Configuration storage
sv: Konfigurationslagring

source: Inserted row id: %1$d
sv: Infogade rad-id: %1$d

source: Signon session name
sv: Signon sessionsnamn

source: The slow query log is disabled.
sv: Den långsamma sökfrågeloggen är inaktiverad.

source: Number of rows per page
sv: Antal rader per sida

source: Garbled Data
sv: Förvanskade data

source: Invalid parameter for CSV import: %s
sv: Ogiltig parameter för CSV-import: %s

source: Immediate table locks: %s%%, this value should be above 95%%
sv: Omedelbara tabellåsningar %s%%, detta värde bör vara över 95%%

source: A TEXT column with a maximum length of 16,777,215 (2^24 - 1) characters, stored with a three-byte prefix indicating the length of the value in bytes
sv: En TEXT-kolumn med en maximal längd av 16.777.215 (2^24-1) tecken, lagrat med ett tre-bytes prefix vilket anger längden av värdet i bytes

source: Recall user name
sv: Återkalla användarnamn

source: Empty username while using [kbd]config[/kbd] authentication method!
sv: Tomt användarnamn vid användning av [kbd]config[/kbd]-autentisering!

source: Wrong username/password. Access denied.
sv: Felaktigt användarnamn/lösenord. Åtkomst nekad.

source: Hardware Security Key (FIDO U2F)
sv: Maskinvarusäkerhetsnyckel (FIDO U2F)

source: A 2-byte integer, signed range is -32,768 to 32,767, unsigned range is 0 to 65,535
sv: Ett 2-bytes heltal, signerat inom intervallet -32.768 till 32.767, osignerat inom intervallet 0 till 65.535

source: Enter the Content-Security-Policy snippet for your reCAPTCHA v2 compatible API.
sv: Ange Content-Security-Policy-snippet för ditt reCAPTCHA v2-kompatibla API.

source: Dump table
sv: Dumpa tabell

source: Save as JSON file
sv: Spara som JSON-fil

source: Procedures
sv: Procedurer

source: Your server is running with default values for the controluser and password (controlpass) and is open to intrusion; you really should fix this security weakness by changing the password for controluser 'pma'.
sv: Servern körs med standardvärden för kontrollanvändaren och lösenordet (controlpass) och är öppen för intrång. Du bör åtgärda denna säkerhetsbrist genom att ändra lösenordet för kontrollanvändaren ”pma”.

source: Normally, writes to the InnoDB buffer pool happen in the background. However, if it's necessary to read or create a page and no clean pages are available, it's necessary to wait for pages to be flushed first. This counter counts instances of these waits. If the buffer pool size was set properly, this value should be small.
sv: Normalt sker skrivningar till InnoDB-bufferten i bakgrunden. Dock om det behövs läsas eller skapas en sida och inga rena sidor finns tillgängliga, så är det nödvändigt att vänta på att sidor rensas först. Denna räknare räknar fall med dessa väntanden. Om buffertstorleken var riktigt satt ska detta värde vara litet.

source: Saving Query-By-Example searches:
sv: Sparande av Query-By-Example-sökningar:

source: This value is interpreted using the 'strftime' function, so you can use time formatting strings. Additionally the following transformations will happen: %s Other text will be kept as is. See the FAQ 6.27 for details.
sv: Detta värde tolkas med funktionen ”strftime”, så du kan använda tidsformateringssträngar. Dessutom sker följande omvandlingar: %s Övrig text behålls som den är. Se FAQ 6.27 för mer information.

source: On completion preserve
sv: Vid avslut, bevara

source: Details…
sv: Detaljer…

source: Session value
sv: Sessionsvärde

source: Tracking data deleted successfully.
sv: Radering av Spårningsdata lyckades.

source: Execute routine
sv: Utför rutin

source: The number of INSERT DELAYED rows written.
sv: Antalet skrivna rader med INSERT DELAYED.

source: The query cache is known to greatly improve performance if configured correctly. Enable it by setting {query_cache_size} to a 2 digit MiB value and setting {query_cache_type} to 'ON'. <b>Note:</b> If you are using memcached, ignore this recommendation.
sv: Frågecachen är känd för att avsevärt förbättra prestanda när den är korrekt konfigurerad. Aktivera den genom att ställa {query_cache_size} till ett 2-siffrigt Mb-värde och sätt {query_cache_type} till "ON". <b>Obs:</b> Om du använder memcached, ignorera denna rekommendation.

source: Data directory
sv: Datakatalog

source: Group queries, ignoring variable data in WHERE clauses
sv: Gruppfrågor, ignorera variabeldata i WHERE-klausuler

source: Database %s has been dropped.
sv: Databasen %s har tagits bort.

source: GiB
sv: GB

source: Showing as PHP code
sv: Visar som PHP-kod

source: Show logo in navigation panel.
sv: Visa logotyp i navigationspanelens.

source: Words or values to search for (wildcard: "%"):
sv: Ord eller värden att söka efter (jokertecken: "%"):

source: Following settings will be applied globally and reset to default on server restart:
sv: Följande inställningar kommer appliceras globalt och återställs till standardvärdet när servern startas om:

source: Error while creating PDF:
sv: Fel vid skapande av PDF:

source: Default database tab
sv: Förvald databasflik

source: Different tmp_table_size and max_heap_table_size
sv: tmp_table_size och max_heap_table_size är olika

source: Definer
sv: Definierare

source: Geometry
sv: Geometri

source: Add constraints
sv: Lägg till restriktioner

source: From
sv: Från

source: Click to toggle
sv: Klicka för att växla

source: Favorites
sv: Favoriter

source: The number of pages created.
sv: Antalet skapade sidor.

source: Version %1$s was created, tracking for %2$s is active.
sv: Version %1$s är skapad, spårning för %2$s är aktiv.

source: Highlight server under the mouse cursor.
sv: Markera server under muspekaren.

source: Incorrect form specified!
sv: Felaktigt formulär angavs.

source: Copy tables to
sv: Kopiera tabeller till

source: Del:
sv: Radera:

source: Delimiter
sv: Avgränsare

source: Template:
sv: Mall:

source: If you have deliberately changed one of either: The server uses the lower value of either to determine the maximum size of in-memory tables. So if you wish to increase the in-memory table limit you will have to increase the other value as well.
sv: Om du medvetet ändrat någondera: Servern använder det lägre värdet av dem för att bestämma den maximala storleken på in-memory tabeller. Så om du vill öka iminnets tabellgräns kommer du behöva öka andra värdet också.

source: Dropping Foreign key.
sv: Radera en foreign key.

source: Improve table structure (Normalization):
sv: Förbättra tabellstrukturen (normalisering):

source: Remove DEFINER clause from definitions
sv: Ta bort DEFINER-satsen från definitioner

source: The selected user was not found in the privilege table.
sv: Den valda användaren kunde inte hittas i privilegietabellen.

source: An alternate port to connect to the host that holds the configuration storage; leave blank to use the default port, or the already defined port, if the controlhost equals host.
sv: En alternativ port för att ansluta till värden som tillhandahåller konfigurationslagring; lämna tomt för att använda standardporten, eller den redan definierade porten, om controlhost motsvarar host.

source: Add an option for column "%s".
sv: Lägg till ett alternativ för kolumnen "%s".

source: Query error
sv: Sökningsfel

source: No versions selected.
sv: Ingen version vald.

source: Use only icons, only text or both.
sv: Använd enbart ikoner, endast text eller både och.

source: PDF export page
sv: PDF-export sida

source: No table selected.
sv: Ingen tabell har valts.

source: A collection of geometry objects of any type
sv: En samling geometriobjekt av valfri typ

source: Rename index
sv: Byt namn på index

source: This server is not configured as replica in a replication process. Would you like to %sconfigure%s it?
sv: Den här servern är inte konfigurerad som replik i en replikeringsprocess. Vill du %skonfigurera%s den?

source: CHAR columns editing
sv: Redigera CHAR-kolumn

source: or type variable name:
sv: eller skriv variabelnamn:

source: Display column for relationships
sv: Visningskolumn för relationer

source: Engines
sv: Motorer

source: The number of buffer pool pages that have been requested to be flushed.
sv: Antalet buffert-sidor som har efterfrågats om att bli rensade.

source: Each point represents a data row.
sv: Varje punkt representerar en dataserie.

source: Both
sv: Båda

source: Maximum items in branch
sv: Maximalt antal objekt i gren

source: Used variable / formula:
sv: Använd variabel/formel:

source: Show detailed MySQL server information
sv: Visa detaljerad MySQL-serverinformation

source: The uploaded file was only partially uploaded.
sv: Den uppladdade filen blev endast delvis uppladdad.

source: Cancel
sv: Avbryt

source: Total
sv: Totalt

source: Managing central list of columns:
sv: Hantering av huvudförteckningen över kolumner:

source: Copy to clipboard
sv: Kopiera till urklipp

source: Please install optional dependencies to enable more authentication backends.
sv: Installera valfria beroenden för att aktivera fler autentiseringsbakändar.

source: Create an index on %s columns
sv: Skapa ett index för %s kolumner

source: Default language
sv: Förvalt språk

source: Classical Latin
sv: Klassisk latin

source: Only single-table UPDATE and DELETE queries can be simulated.
sv: Endast entabells-UPDATE och DELETE-körningar simuleras.

source: Allows dropping databases and tables.
sv: Tillåter borttagning av databaser och tabeller.

source: Central columns table
sv: Huvudkolumnstabell

source: Event scheduler status
sv: Status för händelsehanteraren

source: Monitor
sv: Övervaka

source: A special MySQL user configured with limited permissions, more information available on [doc@linked-tables]documentation[/doc].
sv: En speciell MySQL-användare konfigurerad med begränsade rättigheter, mer information tillgänglig i [doc@linked-tables]dokumentationen[/doc].

source: No Privileges
sv: Inga privilegier

source: Empty signon URL while using [kbd]signon[/kbd] authentication method!
sv: Tom URL för signon vid användning av [kbd]signon[/kbd]-autentisering!

source: Does not require SSL-encrypted connections.
sv: Kräver inte SSL-krypterade anslutningar.

source: Available input transformations
sv: Tillgängliga transformationer av indata

source: Selected time range:
sv: Välj tidsintervall:

source: Rollback when finished
sv: Återställning när du är klar

source: Overview
sv: Översikt

source: phpMyAdmin documentation
sv: phpMyAdmin-dokumentation

source: Showing %1$d bookmark (both private and shared)
sv: Visar %1$d bokmärke (både privata och delade)

source: Showing %1$d bookmarks (both private and shared)
sv: Visar %1$d bokmärken (både privata och delade)

source: Greek
sv: Grekisk

source: Displays a link to download the binary data of the column. You can use the first option to specify the filename, or use the second option as the name of a column which contains the filename. If you use the second option, you need to set the first option to the empty string.
sv: Visar en länk för att ladda ner binära data i kolumnen. Du kan använda det första alternativet för att ange filnamnet eller använda det andra alternativet som namnet på en kolumn som innehåller filnamn. Om du använder det andra alternativet, måste du ställa det första alternativet till den tomma strängen.
